apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2.h
/****************************************************************************
 * arch/arm/src/common/stm32/hardware/stm32_adc_v2.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V2_H
#define __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_ADC_V2_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* This is implementation for STM32 ADC IPv2 - F0, F3 (without F37x),
 * H7, L0, L4, L4+
 */

#define HAVE_IP_ADC_V2
#undef HAVE_IP_ADC_V1           /* No ADC IPv1 */
#undef HAVE_ADC_CLOCK_HSI       /* No ADC clock from HSI */
#undef HAVE_ADC_POWERDOWN       /* No ADC power down */
#define HAVE_ADC_VBAT           /* VBAT channel support */

/* F0 and L0 have basic version of ADC hardware (not present here for now):
 *   - channel selection register (CHSELR)
 *   - sampling time configuration common for all channels
 *   - one TR register
 *   - no SQR registers
 *   - ...
 *
 * TODO: definitions for basic STM32 ADC IPv2 (F0, L0)
 */

#ifdef CONFIG_STM32_HAVE_IP_ADC_M3M4_V2_BASIC
#  define HAVE_BASIC_ADC
#  error TODO
#else
#  undef HAVE_BASIC_ADC
#endif

/* F30X and F33x don't have CFGR2 register */

#if defined(CONFIG_STM32_STM32F30XX) || defined(CONFIG_STM32_STM32F33XX)
#  undef HAVE_ADC_CFGR2
#else
#  define HAVE_ADC_CFGR2
#endif

/* Base addresses ***********************************************************/

#define STM32_ADC1_OFFSET              0x0000
#define STM32_ADC2_OFFSET              0x0100
#define STM32_ADC3_OFFSET              0x0000
#define STM32_ADC4_OFFSET              0x0100
#define STM32_ADCCMN_OFFSET            0x0300

#define STM32_ADC1_BASE                (STM32_ADC1_OFFSET + STM32_ADC12_BASE)   /* ADC1 Master ADC */
#define STM32_ADC2_BASE                (STM32_ADC2_OFFSET + STM32_ADC12_BASE)   /* ADC2 Slave ADC */
#define STM32_ADC3_BASE                (STM32_ADC3_OFFSET + STM32_ADC34_BASE)   /* ADC3 Master ADC */
#define STM32_ADC4_BASE                (STM32_ADC4_OFFSET + STM32_ADC34_BASE)   /* ADC4 Slave ADC */
#define STM32_ADC12CMN_BASE            (STM32_ADCCMN_OFFSET + STM32_ADC12_BASE) /* ADC1, ADC2 common */
#define STM32_ADC34CMN_BASE            (STM32_ADCCMN_OFFSET + STM32_ADC34_BASE) /* ADC3, ADC4 common */

/* Register Offsets *********************************************************/

#define STM32_ADC_ISR_OFFSET           0x0000  /* ADC interrupt and status register */
#define STM32_ADC_IER_OFFSET           0x0004  /* ADC interrupt enable register */
#define STM32_ADC_CR_OFFSET            0x0008  /* ADC control register */
#define STM32_ADC_CFGR1_OFFSET         0x000c  /* ADC configuration register 1 */
#ifdef HAVE_ADC_CFGR2
#  define STM32_ADC_CFGR2_OFFSET       0x0010  /* ADC configuration register 2 */
#endif
#define STM32_ADC_SMPR1_OFFSET         0x0014  /* ADC sample time register 1 */
#define STM32_ADC_SMPR2_OFFSET         0x0018  /* ADC sample time register 2 */
#define STM32_ADC_TR1_OFFSET           0x0020  /* ADC watchdog threshold register 1 */
#define STM32_ADC_TR2_OFFSET           0x0024  /* ADC watchdog threshold register 2 */
#define STM32_ADC_TR3_OFFSET           0x0028  /* ADC watchdog threshold register 3 */
#define STM32_ADC_SQR1_OFFSET          0x0030  /* ADC regular sequence register 1 */
#define STM32_ADC_SQR2_OFFSET          0x0034  /* ADC regular sequence register 2 */
#define STM32_ADC_SQR3_OFFSET          0x0038  /* ADC regular sequence register 3 */
#define STM32_ADC_SQR4_OFFSET          0x003c  /* ADC regular sequence register 4 */
#define STM32_ADC_DR_OFFSET            0x0040  /* ADC regular data register */
#define STM32_ADC_JSQR_OFFSET          0x004c  /* ADC injected sequence register */
#define STM32_ADC_OFR1_OFFSET          0x0060  /* ADC offset register 1 */
#define STM32_ADC_OFR2_OFFSET          0x0064  /* ADC offset register 2 */
#define STM32_ADC_OFR3_OFFSET          0x0068  /* ADC offset register 3 */
#define STM32_ADC_OFR4_OFFSET          0x006c  /* ADC data offset register 4 */
#define STM32_ADC_JDR1_OFFSET          0x0080  /* ADC injected data register 1 */
#define STM32_ADC_JDR2_OFFSET          0x0084  /* ADC injected data register 2 */
#define STM32_ADC_JDR3_OFFSET          0x0088  /* ADC injected data register 3 */
#define STM32_ADC_JDR4_OFFSET          0x008c  /* ADC injected data register 4 */
#define STM32_ADC_AWD2CR_OFFSET        0x00a0  /* ADC analog watchdog 2 configuration register */
#define STM32_ADC_AWD3CR_OFFSET        0x00a4  /* ADC analog watchdog 3 configuration register */
#define STM32_ADC_DIFSEL_OFFSET        0x00b0  /* ADC differential mode selection register */
#define STM32_ADC_CALFACT_OFFSET       0x00b4  /* ADC calibration factors */

/* Master and Slave ADC Common Registers */

#define STM32_ADC_CSR_OFFSET           0x0000  /* Common status register */
#define STM32_ADC_CCR_OFFSET           0x0008  /* Common control register */
#define STM32_ADC_CDR_OFFSET           0x000c  /* Common regular data register for dual mode */

