apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_adc_v2.h
#if STM32_NADC > 3
#  define STM32_ADC4_ISR               (STM32_ADC4_BASE + STM32_ADC_ISR_OFFSET)
#  define STM32_ADC4_IER               (STM32_ADC4_BASE + STM32_ADC_IER_OFFSET)
#  define STM32_ADC4_CR                (STM32_ADC4_BASE + STM32_ADC_CR_OFFSET)
#  define STM32_ADC4_CFGR1             (STM32_ADC4_BASE + STM32_ADC_CFGR1_OFFSET)
#  ifdef HAVE_ADC_CFGR2
#    define STM32_ADC4_CFGR2           (STM32_ADC4_BASE + STM32_ADC_CFGR2_OFFSET)
#  endif
#  define STM32_ADC4_SMPR1             (STM32_ADC4_BASE + STM32_ADC_SMPR1_OFFSET)
#  define STM32_ADC4_SMPR2             (STM32_ADC4_BASE + STM32_ADC_SMPR2_OFFSET)
#  define STM32_ADC4_TR1               (STM32_ADC4_BASE + STM32_ADC_TR1_OFFSET)
#  define STM32_ADC4_TR2               (STM32_ADC4_BASE + STM32_ADC_TR2_OFFSET)
#  define STM32_ADC4_TR3               (STM32_ADC4_BASE + STM32_ADC_TR3_OFFSET)
#  define STM32_ADC4_SQR1              (STM32_ADC4_BASE + STM32_ADC_SQR1_OFFSET)
#  define STM32_ADC4_SQR2              (STM32_ADC4_BASE + STM32_ADC_SQR2_OFFSET)
#  define STM32_ADC4_SQR3              (STM32_ADC4_BASE + STM32_ADC_SQR3_OFFSET)
#  define STM32_ADC4_SQR4              (STM32_ADC4_BASE + STM32_ADC_SQR4_OFFSET)
#  define STM32_ADC4_DR                (STM32_ADC4_BASE + STM32_ADC_DR_OFFSET)
#  define STM32_ADC4_JSQR              (STM32_ADC4_BASE + STM32_ADC_JSQR_OFFSET)
#  define STM32_ADC4_OFR1              (STM32_ADC4_BASE + STM32_ADC_OFR1_OFFSET)
#  define STM32_ADC4_OFR2              (STM32_ADC4_BASE + STM32_ADC_OFR2_OFFSET)
#  define STM32_ADC4_OFR3              (STM32_ADC4_BASE + STM32_ADC_OFR3_OFFSET)
#  define STM32_ADC4_OFR4              (STM32_ADC4_BASE + STM32_ADC_OFR4_OFFSET)
#  define STM32_ADC4_JDR1              (STM32_ADC4_BASE + STM32_ADC_JDR1_OFFSET)
#  define STM32_ADC4_JDR2              (STM32_ADC4_BASE + STM32_ADC_JDR2_OFFSET)
#  define STM32_ADC4_JDR3              (STM32_ADC4_BASE + STM32_ADC_JDR3_OFFSET)
#  define STM32_ADC4_JDR4              (STM32_ADC4_BASE + STM32_ADC_JDR4_OFFSET)
#  define STM32_ADC4_AWD2CR            (STM32_ADC4_BASE + STM32_ADC_AWD2CR_OFFSET)
#  define STM32_ADC4_AWD3CR            (STM32_ADC4_BASE + STM32_ADC_AWD3CR_OFFSET)
#  define STM32_ADC4_DIFSEL            (STM32_ADC4_BASE + STM32_ADC_DIFSEL_OFFSET)
#  define STM32_ADC4_CALFACT           (STM32_ADC4_BASE + STM32_ADC_CALFACT_OFFSET)
#endif

#if STM32_NADC > 0
#  define STM32_ADC12_CSR              (STM32_ADC12CMN_BASE + STM32_ADC_CSR_OFFSET)
#  define STM32_ADC12_CCR              (STM32_ADC12CMN_BASE + STM32_ADC_CCR_OFFSET)
#  define STM32_ADC12_CDR              (STM32_ADC12CMN_BASE + STM32_ADC_CDR_OFFSET)
#endif

#if STM32_NADC > 2
#  define STM32_ADC34_CSR              (STM32_ADC34CMN_BASE + STM32_ADC_CSR_OFFSET)
#  define STM32_ADC34_CCR              (STM32_ADC34CMN_BASE + STM32_ADC_CCR_OFFSET)
#  define STM32_ADC34_CDR              (STM32_ADC34CMN_BASE + STM32_ADC_CDR_OFFSET)
#endif

/* Register Bitfield Definitions ********************************************/

/* ADC interrupt and status register (ISR), and
 * ADC interrupt enable register (IER)
 */

#define ADC_INT_ARDY                   (1 << 0)  /* Bit 0:  ADC ready */
#define ADC_INT_EOSMP                  (1 << 1)  /* Bit 1:  End of sampling flag */
#define ADC_INT_EOC                    (1 << 2)  /* Bit 2:  End of conversion */
#define ADC_INT_EOS                    (1 << 3)  /* Bit 3:  End of regular sequence flag */
#define ADC_INT_OVR                    (1 << 4)  /* Bit 4:  Overrun */
#define ADC_INT_JEOC                   (1 << 5)  /* Bit 5:  Injected channel end of conversion */
#define ADC_INT_JEOS                   (1 << 6)  /* Bit 6:  Injected channel end of sequence flag */
#define ADC_INT_AWD1                   (1 << 7)  /* Bit 7:  Analog watchdog 1 flag */
#define ADC_INT_AWD2                   (1 << 8)  /* Bit 8:  Analog watchdog 2 flag */
#define ADC_INT_AWD3                   (1 << 9)  /* Bit 9:  Analog watchdog 3 flag */
#define ADC_INT_JQOVF                  (1 << 10) /* Bit 10: Injected context queue overflow */

/* ADC control register */

#define ADC_CR_ADEN                  (1 << 0)                        /* Bit 0: ADC enable control */
#define ADC_CR_ADDIS                 (1 << 1)                        /* Bit 1: ADC disable command */
#define ADC_CR_ADSTART               (1 << 2)                        /* Bit 2: ADC start of regular conversion */
#define ADC_CR_JADSTART              (1 << 3)                        /* Bit 3: ADC start of injected conversion */
#define ADC_CR_ADSTP                 (1 << 4)                        /* Bit 4: ADC stop of regular conversion command */
#define ADC_CR_JADSTP                (1 << 5)                        /* Bit 5: ADC stop of injected conversion command */
#define ADC_CR_ADVREGEN_SHIFT        (28)                            /* Bits 28-29: ADC voltage regulator enable */
#define ADC_CR_ADVREGEN_MASK         (3 << ADC_CR_ADVREGEN_SHIFT)
#  define ADC_CR_ADVREGEN_INTER      (0 << ADC_CR_ADVREGEN_SHIFT)    /* Intermediate state */
#  define ADC_CR_ADVREGEN_ENABLED    (1 << ADC_CR_ADVREGEN_SHIFT)    /* ADC Voltage regulator enabled */
#  define ADC_CR_ADVREGEN_DISABLED   (2 << ADC_CR_ADVREGEN_SHIFT)    /* ADC Voltage regulator disabled */
#define ADC_CR_ADCALDIF              (1 << 30)                       /* Bit 30: Differential mode for calibration */
#define ADC_CR_ADCAL                 (1 << 31)                       /* Bit 31: ADC calibration */

/* ADC configuration register 1 */

#define ADC_CFGR1_DMAEN               (1 << 0)                       /* Bit 0:  Direct memory access enable */
#define ADC_CFGR1_DMACFG              (1 << 1)                       /* Bit 1:  Direct memory access configuration */
#define ADC_CFGR1_RES_SHIFT           (3)                            /* Bits 3-4: Data resolution */
#define ADC_CFGR1_RES_MASK            (3 << ADC_CFGR1_RES_SHIFT)
#  define ADC_CFGR1_RES_12BIT         (0 << ADC_CFGR1_RES_SHIFT)     /* 15 ADCCLK cycles */
#  define ADC_CFGR1_RES_10BIT         (1 << ADC_CFGR1_RES_SHIFT)     /* 13 ADCCLK cycles */
#  define ADC_CFGR1_RES_8BIT          (2 << ADC_CFGR1_RES_SHIFT)     /* 11 ADCCLK cycles  */
#  define ADC_CFGR1_RES_6BIT          (3 << ADC_CFGR1_RES_SHIFT)     /* 9 ADCCLK cycles  */
#define ADC_CFGR1_ALIGN               (1 << 5)                       /* Bit 5:  Data Alignment */
#define ADC_CFGR1_EXTSEL_SHIFT        (6)                            /* Bits 6-9: External Event Select for regular group */
#define ADC_CFGR1_EXTSEL_MASK         (15 << ADC_CFGR1_EXTSEL_SHIFT)
#if defined(CONFIG_STM32_STM32F33XX)
#  define ADC12_CFGR1_EXTSEL_T1CC1    (0 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC2    (1 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC3    (2 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2CC2    (3 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3TRGO   (4 << ADC_CFGR1_EXTSEL_SHIFT)
                                                                     /* 0101: Reserved */
#  define ADC12_CFGR1_EXTSEL_EXTI11   (6 << ADC_CFGR1_EXTSEL_SHIFT)  /* 0110: EXTI line 11 */
#  define ADC12_CFGR1_EXTSEL_HRT1TRG1 (7 << ADC_CFGR1_EXTSEL_SHIFT)  /* 0111: HRTIM1 ADCTRG1 event */
#  define ADC12_CFGR1_EXTSEL_HRT1TRG3 (8 << ADC_CFGR1_EXTSEL_SHIFT)  /* 1000: HRTIM1 ADCTRG3 event */
#  define ADC12_CFGR1_EXTSEL_T1TRGO   (9 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1TRGO2  (10 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2TRGO   (11 << ADC_CFGR1_EXTSEL_SHIFT)
                                                                     /* 1100: Reserved */
#  define ADC12_CFGR1_EXTSEL_T6TRGO   (13 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T15TRGO  (14 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3CC4    (15 << ADC_CFGR1_EXTSEL_SHIFT)
#elif defined(CONFIG_STM32_STM32F30XX)
#  define ADC12_CFGR1_EXTSEL_T1CC1     (0 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC2     (1 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1CC3     (2 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2CC2     (3 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3TRGO    (4 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T4CC4     (5 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_EXTI11    (6 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T8TRGO    (7 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T1TRGO    (9 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T2TRGO    (11 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T4TRGO    (12 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T6TRGO    (13 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T15TRGO   (14 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC12_CFGR1_EXTSEL_T3CC4     (15 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T3CC1     (0 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2CC3     (1 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T1CC3     (2 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T8CC1     (3 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T8TRGO    (4 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T20TRGO   (5 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T4CC1     (6 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2TRGO    (7 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T1TRGO    (9 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T3TRGO    (11 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T4TRGO    (12 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T7TRGO    (13 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T15TRGO   (14 << ADC_CFGR1_EXTSEL_SHIFT)
#  define ADC34_CFGR1_EXTSEL_T2CC1     (15 << ADC_CFGR1_EXTSEL_SHIFT)
#else
#  error TODO EXTSEL
#endif
#define ADC_CFGR1_EXTEN_SHIFT         (10)                         /* Bits 10-11: External trigger/polarity selection regular channels */
#define ADC_CFGR1_EXTEN_MASK          (3 << ADC_CFGR1_EXTEN_SHIFT)
#  define ADC_CFGR1_EXTEN_NONE        (0 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection disabled */
#  define ADC_CFGR1_EXTEN_RISING      (1 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on the rising edge */
#  define ADC_CFGR1_EXTEN_FALLING     (2 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on the falling edge */
#  define ADC_CFGR1_EXTEN_BOTH        (3 << ADC_CFGR1_EXTEN_SHIFT) /* Trigger detection on both edges */
#define ADC_CFGR1_OVRMOD              (1 << 12)                    /* Bit 12: Overrun Mode */
#define ADC_CFGR1_CONT                (1 << 13)                    /* Bit 13: Continuous mode for regular conversions */
#define ADC_CFGR1_AUTDLY              (1 << 14)                    /* Bit 14: Delayed conversion mode */
#define ADC_CFGR1_DISCEN              (1 << 16)                    /* Bit 16: Discontinuous mode on regular channels */
#define ADC_CFGR1_DISCNUM_SHIFT       (17)                         /* Bits 17-19: Discontinuous mode channel count */
#define ADC_CFGR1_DISCNUM_MASK        (7 << ADC_CFGR1_DISCNUM_SHIFT)
#  define ADC_CFGR1_DISCNUM(n)        (((n) - 1) << \
                                       ADC_CFGR1_DISCNUM_SHIFT)    /* n = 1..8 channels */
#define ADC_CFGR1_JDISCEN             (1 << 20)                    /* Bit 20: Discontinuous mode on injected channels */
#define ADC_CFGR1_JQM                 (1 << 21)                    /* Bit 21: JSQR queue mode */
#define ADC_CFGR1_AWD1SGL             (1 << 22)                    /* Bit 22: Enable watchdog on single/all channels */
#define ADC_CFGR1_AWD1EN              (1 << 23)                    /* Bit 23: Analog watchdog enable 1 regular channels */
#define ADC_CFGR1_JAWD1EN             (1 << 24)                    /* Bit 24: Analog watchdog enable 1 injected channels */
#define ADC_CFGR1_JAUTO               (1 << 25)                    /* Bit 25: Automatic Injected Group conversion */
#define ADC_CFGR1_AWD1CH_SHIFT        (26)                         /* Bits 26-30: Analog watchdog 1 channel select bits */
#define ADC_CFGR1_AWD1CH_MASK         (31 << ADC_CFGR1_AWD1CH_SHIFT)
#  define ADC_CFGR1_AWD1CH_DISABLED   (0 << ADC_CFGR1_AWD1CH_SHIFT)

/* TODO: ADC configuration register 2 */

/* ADC sample time register 1 */

#define ADC_SMPR_1p5                   0         /* 000: 1.5 cycles */
#define ADC_SMPR_2p5                   1         /* 001: 2.5 cycles */
#define ADC_SMPR_4p5                   2         /* 010: 4.5 cycles */
#define ADC_SMPR_7p5                   3         /* 011: 7.5 cycles */
#define ADC_SMPR_19p5                  4         /* 100: 19.5 cycles */
#define ADC_SMPR_61p5                  5         /* 101: 61.5 cycles */
#define ADC_SMPR_181p5                 6         /* 110: 181.5 cycles */
#define ADC_SMPR_601p5                 7         /* 111: 601.5 cycles */

